power = "Сила — это физическая величина, характеризующая действие одного тела на другое. \n Сила - F \n сила\n"
powerUpr = "Силу, возникающую в теле в результате его упругой деформации и стремящуюся вернуть тело в исходное состояние, называют силой упругости. \n Сила упругости - F упр=kx \n k=жёсткость тела \n x=измерение длины \n k можно найти с помощью: k=F упр/x \n сила упругости \n \n"
powerEarth = "Силу, с которой Земля притягивает к себе тело, называют силой тяжести. Притяжение всех тел Вселенной друг к другу называют всемирным тяготением. \n Сила тяжести - F=mg \n m=масса тела \n g=ускорение свободного падения (10 м\с²) \n сила тяжести \n \n"
powerVes = "Вес тела — это сила, с которой тело действует на подвес или опору вследствие притяжения Земле. \n вес тела \n \n"
powerTr = "Сила трения — это сила, возникающая при соприкосновении двух тел и препятствующая их относительному движению. \n сила трения \n \n"
powerRavno = "Силу, которая производит на тело такое же действие, как несколько одновременно действующих на это сил, называют равнодействующей этих сил. \n Равнодействущая сил - R=F₁+F₂ или если \n силы направлены в противоположные сторону R=F₂-F₁ \n равнодействущая сил \n \n"
powerArh = "Выталкивающая сила, действующая на тело, погруженное в жидкость (газ) и равная весу вытесненной телом жидкости (газа) - архимедова сила \n \n FАрх = ρ жидкости * g * Vпогр., где ρ жидкости — плотность жидкости [кг/м3], Vпогр. — объем погруженной части тела [м3], g — ускорение свободного падения [м/с2]"

listPowers = [power, powerUpr, powerEarth, powerVes, powerTr, powerRavno, powerArh]


molekyla = "Мельчайшая частица данного вещества - молекула"
diffuz = "Взаимное проникновение одного вещества между молекулами другого - диффузия"
mehdvizh =  "Изменение положения тела в пространстве относительно других тел с течением времени - механическое движение \n ʋ = S / t"
traektory = "Линия, по которой движется тело - траектория"
put = "Длина траектории, по которой движется тело в течении некоторого промежутка времени - путь"
speed = "Величина, равная отношению пути ко времени, за которое этот путь пройден - скорость"
plotnost = "Физическая величина, равная отношению массы тела к его объёму - плотность"
sila = "Мера механического воздействия на тело со стороны других тел - сила"
deformaciya = "Любое изменение формы и размеров тела - деформация"
davleniye = "Физическая величина, равная отношению силы, действующей перпендикулярно некоторой поверхности, к площади этой поверхности - давление \n p=F/S"
atmosdavleniye = "Давление атмосферы, действующее на все находящиеся в ней предметы и на земную поверхность, равное модулю силы, действующей в атмосфере, на единицу площади поверхности по нормали к ней - атмосферное давление"
osadka = "Глубина, на которую судно погружается в воду - осадка"
waterline = "Наибольшая допустимая осадка, отмеченная на корпусе судна красной линией - ватерлиния"
moshnost = "Физическая величина, численно равная работе, совершенной за единицу времени - мощность \n \n N = A / t, где A — работа, t — время ее совершения"

phisic = "Наука, изучающая явления природы, свойства и строение материи - физика"
materya = "Всё, что есть во Вселенной - материя"
ravnodvizh = "Движение, при котором тело за любые равные промежутки времени проходит одинаковые пути - равномерное движение"
inertsia = "Явление сохранения скорости тела при отсутствии действия на него других тел - инерция"
tormput = "Путь, который проходит автомобиль после выключения двигателя до полной остановки - тормозной путь"
rabota = "Величина, равная произведению приложенной силы на пройденный путь - работа \n A=F*S"
richag = "Твёрдое тело, которое может вращаться вокруг неподвижной опоры - рычаг"
kpd = "Отношение полезной работы к полной работе - КПД \n \n кпд"
potenenerg = "Энергия взаимодействия - потенциальная энергия"
kinerg = "Энергия движения - кинетическая энергия"


listOprs = [molekyla, diffuz, mehdvizh, traektory, put, speed, plotnost, sila, deformaciya, davleniye, atmosdavleniye, osadka, waterline, moshnost, phisic, materya, ravnodvizh, inertsia, tormput, rabota, richag, kpd, potenenerg, kinerg]
listAll = [listPowers, listOprs]



shpora1 = "1. Первое задание на единицы измерения! \n \n 2. Какое движение называют равномерным? \n Ответ: Равномерным движением называется такое движение, при котором тело за любые равные промежутки времени проходит одинаковые расстояния. \n \n 3.По какой формуле можно расчитать путь при равномерном движении? \n Ответ: Чтобы определить путь, который прошло тело при равномерном движении, необходимо скорость движения тела умножить на время которое это тело двигалось. \n S=V*t \n \n 4. Плотность - это физическая величина, показывающая... \n Ответ: Плотность — это физическая величина, показывающая какой массой обладает вещество, занимающее единицу объёма. Значит, плотность равна отношению массы тела к его объему. \n \n 5. По какой формуле можно расчитать массу тела? \n Ответ: Плотность тела нужно умножить на его объём по формуле: \n m=pV \n \n 6. Сила тяжести - это сила... \n Ответ: Сила тяжести — это сила, с которой Земля притягивает к себе тела. Сила тяжести направлена вертикально вниз. \n \n 7. По какой формуле можно определить силу тяжести? \n Ответ: F=mg \n m — масса тела, а g — ускорение свободного падения. \n \n 8. Давление твёрдого тела на поверхность можно вычислить с помощью формулы... \n Ответ: P = F / S, \n Где:P — давление тела на поверхность; \n F — сила тела, которая действует на поверхность; \n S — площадь поверхности. \n \n 9. Формула давления жидкости и газов на дно сосудов? \n Ответ: p = gρh, где \n g - коэффициент тяжести, \n ρ - плотность, \n h – высота столба жидкости или газа. \n \n 10. Архимедова сила определяется по формуле... \n Ответ: FАрх = ρжgVпогр где \n ρж — плотность жидкости [кг/м3] \n Vпогр — объем погруженной части тела [м3] \n g — ускорение свободного падения [м/с²]"
shpora2 = "1. Первое задание на единицы измерения! \n \n 2. Что такое инерция? \n Ответ: Инерция - это явление сохранения скорости тела при отсутствии действия на него других тел. \n \n 3. Что такое вещество? \n Ответ: Вещество - это то, из чего состоит тело. \n \n 4. Молекула - это... \n Ответ: Молекула – мельчайшая частица данного вещества. \n \n 5. По какой формуле можно вычислить вес тела, если скорость постоянна? \n Ответ: P=mg где \n P - вес тела \n m - масса тела [кг] \n g - ускорения свободного падения [м/с²] \n \n 6. Между молекулами существует: \n Ответ: Между молекулами существует взаимное притяжение и отталкивание. \n \n 7. Механическую работу можно расчитать по формуле: \n Ответ: A = F*S,где \n  F — действующая сила, \n S — пройденный телом путь.Измеряется в джоулях(Дж) \n \n 8. Выталкивающая в жидкостях и газах сила определяется по формуле: \n Ответ: Fa=ρ*g*V, где \n ρ — плотность жидкости, \n V — объем погруженной части тела, \n g — ускорение Свободного падения. \n \n Силу упругости можно определить по формуле: \n Ответ: F упр=kx, где \n k=жёсткость тела \n x=измерение длины. \n \n Равнодействущая двух сил направленных по одной прямой в одну сторону и в противоположные стороны, равна: \n Ответ: R=F₁+F₂ для сил в одном направлении, R=F₂-F₁ для сил в противоположных направлениях. "
ids = "1 2"
idsshopr = [shpora1, shpora2]